# Задание 1_Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = [1,2....]

SyntaxError: invalid syntax (<ipython-input-2-13550bc1d159>, line 6)

#### 0. Создать датафрейм.

In [3]:
frame = pd.DataFrame({'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']})
frame

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  65.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 1. Вывести информацию о датафрейме.

In [4]:
frame.shape

(10, 4)

In [5]:
frame.columns

Index(['Surname', 'age', 'visits', 'priority'], dtype='object')

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [6]:
frame.head(3)

   Surname   age  visits priority
0   Ivanov  42.0       1      yes
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no

#### 3. Выберите только столбцы 'Surname' и 'age' из DataFrame `df`.

In [7]:
frame[['Surname', 'age']]

    Surname   age
0    Ivanov  42.0
1    Petrov  33.0
2   Sidorov  55.0
3   Ivanova   NaN
4    Karpov  65.0
5      Hill  23.0
6      Boni  25.0
7  Mitchell   NaN
8      Onio  27.0
9    Lavrov  37.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['Surname', 'age']`.

In [8]:
frame.loc[[3, 4, 8], ['Surname', 'age']]

   Surname   age
3  Ivanova   NaN
4   Karpov  65.0
8     Onio  27.0

#### 5. Выберите строки где количество посещений банка больше 3.

In [9]:
frame[frame.visits > 3]

Empty DataFrame
Columns: [Surname, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [16]:
frame.fillna({'age':0})
frame[frame['age']==0.0]

Empty DataFrame
Columns: [Surname, age, visits, priority]
Index: []

#### 7. Выберите строки, в которых клиент был больше 2х раз в банке * и * возраст составляет более 30 лет.

In [12]:
frame.loc[(frame['visits'] > 2) & (frame['age'] > 30)]

  Surname   age  visits priority
1  Petrov  33.0       3      yes

#### 8. Выберите строки в которых возраст от 55 до 65 (включительно).

In [13]:
frame.loc[(frame['age'] > 55) & (frame['age'] <= 65)]

  Surname   age  visits priority
4  Karpov  65.0       2       no

#### 9. Измените возраст в строке '4' на 44.

In [158]:
frame.at[4, 'age'] = 44
frame

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  44.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [159]:
frame['visits'].sum()

19

#### 11. Расчитайте средний возраст клиентов

In [160]:
frame['age'].mean()

35.75

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [20]:
k = {'Surname':'Orlov', 'age':'50', 'visits':'1', 'priority':'yes'}
frame = frame.append(k, ignore_index=True)
frame

     Surname  age visits priority
0     Ivanov   42      1      yes
1     Petrov   33      3      yes
2    Sidorov   55      2       no
3    Ivanova  NaN      3      yes
4     Karpov   65      2       no
5       Hill   23      3       no
6       Boni   25      1       no
7   Mitchell  NaN      1      yes
8       Onio   27      2       no
9     Lavrov   37      1       no
10     Orlov   50      1      yes
11     Orlov   50      1      yes

In [21]:
frame.drop(frame.index[10], inplace=True)
frame

     Surname  age visits priority
0     Ivanov   42      1      yes
1     Petrov   33      3      yes
2    Sidorov   55      2       no
3    Ivanova  NaN      3      yes
4     Karpov   65      2       no
5       Hill   23      3       no
6       Boni   25      1       no
7   Mitchell  NaN      1      yes
8       Onio   27      2       no
9     Lavrov   37      1       no
11     Orlov   50      1      yes

#### 13. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [163]:
frame.sort_values(by=['age', 'visits'])

    Surname  age visits priority
5      Hill   23      3       no
6      Boni   25      1       no
8      Onio   27      2       no
1    Petrov   33      3      yes
9    Lavrov   37      1       no
0    Ivanov   42      1      yes
4    Karpov   44      2       no
2   Sidorov   55      2       no
7  Mitchell  NaN      1      yes
3   Ivanova  NaN      3      yes

#### 14. В столбце приоритет замените значения на `Yes` и `No`

In [164]:
frame.loc[frame['priority'] == 'yes', 'priority'] = 'Yes'
frame.loc[frame['priority'] == 'no', 'priority'] = 'No'
frame

    Surname  age visits priority
0    Ivanov   42      1      Yes
1    Petrov   33      3      Yes
2   Sidorov   55      2       No
3   Ivanova  NaN      3      Yes
4    Karpov   44      2       No
5      Hill   23      3       No
6      Boni   25      1       No
7  Mitchell  NaN      1      Yes
8      Onio   27      2       No
9    Lavrov   37      1       No

#### 15. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [22]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'})
df

,c,a,e,f,d,j,g,h,b,i
0,0.268359,0.165161,0.225639,0.796453,0.830780,0.068775,0.210081,0.146463,0.520364,0.215282
1,0.906506,0.850654,0.160092,0.357701,0.476481,0.619983,0.657531,0.886496,0.729719,0.246458
2,0.308888,0.752012,0.446893,0.966063,0.886435,0.089700,0.722722,0.898986,0.411115,0.234775
3,0.874516,0.745681,0.457692,0.674315,0.734580,0.920886,0.680698,0.251504,0.557294,0.911474
4,0.342891,0.101061,0.074214,0.936836,0.682320,0.792295,0.891071,0.761740,0.292676,0.972062

In [23]:
summ = pd.DataFrame(df.sum())
summ

          0
c  2.701161
a  2.614569
e  1.364530
f  3.731368
d  3.610595
j  2.491639
g  3.162104
h  2.945190
b  2.511167
i  2.580052

In [167]:
summ.loc[summ.idxmin()]

          0
e  1.546476

#### 16. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [24]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [169]:
df['value'].fillna(df['value'].mean(), inplace = True)
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 17. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [32]:
df = pd.DataFrame({'From_To': ['London_Paris', 'Madrid_Milan', 'london_Stockholm', 
                               'Budapest_Paris', 'Brussels_london'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [33]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_Paris       10045.0      [23, 47]               KLM(!)
1      Madrid_Milan           NaN            []    <Air France> (12)
2  london_Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_Paris           NaN          [13]       12. Air France
4   Brussels_london       10085.0      [67, 32]          "Swiss Air"

In [34]:
df['From'] = ['']*5
df['To'] = ['']*5
df

            From_To  FlightNumber  RecentDelays              Airline From To
0      London_Paris       10045.0      [23, 47]               KLM(!)
1      Madrid_Milan           NaN            []    <Air France> (12)
2  london_Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_Paris           NaN          [13]       12. Air France
4   Brussels_london       10085.0      [67, 32]          "Swiss Air"

#### 23. Загрузить свою таблицу данных(из реферата, курсовой, из сайта статистических данных). 

Выполните действия с таблицей:

Загрузите таблицу из файла и сохраните ее в переменную df. Используйте функцию read_

Выведите общую информацию по таблице: число строк и столбцов, типы данных в таблице. 

Есть ли в таблице пропущенные значения?

Если в таблице есть строки с пропущенными значениями, удалите их.

Сохраните изменения в df.

Выведите на экран описательные статистики по всем количественным переменным в таблице. 

Выберите какой-нибудь интересующий вас столбец и проинтерпретируйте описательные статистики по нему (т.е. опишите «обычными» словами, что значат значения типа min, std, 50% и так далее).


Переименуйте какие-нибудь столбцы в таблице (хотя бы один, можно несколько) и сохраните изменения в df.

Добавьте новые столбцы.

ссылки на сайты стат данных

    
https://data.gov.ru/taxonomy/term/9/datasets
    
http://sophist.hse.ru/rstat/

можно взять данные из задач 

https://github.com/hightemp/docNN/blob/b96f37611dd3ebdd5b2269e04582683af74b8340/articles/%D0%9F%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BC%D0%B0%D1%88%D0%B8%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BE%D0%B1%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B8%20Data%20Science%20%D0%B2%20%D0%BF%D1%80%D0%BE%D0%BC%D1%8B%D1%88%D0%BB%D0%B5%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.md